## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   NAME                   |
|--------|------------------------------------------|
| add    | `aws_route53_record.ai_answers_wildcard` |
| delete | `aws_route53_record.ai_answers`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.ai_answers will be destroyed
  # (because aws_route53_record.ai_answers is not in configuration)
  - resource "aws_route53_record" "ai_answers" {
      - fqdn                             = "ai-answers.cdssandbox.xyz" -> null
      - id                               = "Z0155535SR6XQTKZDGDA_ai-answers.cdssandbox.xyz_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "ai-answers.cdssandbox.xyz" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z0155535SR6XQTKZDGDA" -> null
        # (2 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "ai-answers-lb-1206359941.ca-central-1.elb.amazonaws.com" -> null
          - zone_id                = "ZQSVJUPU6J1EY" -> null
        }
    }

  # aws_route53_record.ai_answers_wildcard will be created
  + resource "aws_route53_record" "ai_answers_wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ai-answers.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z0155535SR6XQTKZDGDA"

      + alias {
          + evaluate_target_health = false
          + name                   = "ai-answers-lb-1206359941.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.ai_answers_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ai_answers_load_balancer_sg"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
